#+setupfile: ~/.emacs.d/latex.org
#+title: Lab 7
#+property: header-args:R :session *R* :exports both :eval no
#+property: header-args:Python :session *Python* :results output :exports both :tangle ./src/script.py :eval no
#+property: header-args:Bash :session *Bash* :exports both :eval no

The link to the entire directory is [[https://github.com/adsfibonacci/bioinf595_structural_biology/tree/master/lab7][here]].

\newpage
* Discussion (Part 4)
The PyRosetta mutation scan predicts how mutations affect the structural stability $(\Delta\Delta G)$ of MC4R in a specific conformational state.
Mutations that strongly destabilize the protein are likely to disrupt folding or stability, which can reduce receptor signaling activity in the experimental assay.
A strength of this approach is that it uses a physics-based energy function to model structural interactions and identify mutations that significantly disrupt the protein structure.

A weakness is the G proteins aren't static and shift between active and inactive states during signalling, which means the ligand binding, G-protein coupling, and membrane interactions aren't perfectly modeled.

ref2015 is good for physical interactions and physics forces such as van der Waals forces and hydrogen bonds.
It doesn't necessarily capture the long range electrostatics and conformational variance due to the alternation between active and inactive states.
beta_jan25 and newer energy functions are trained on larger or more specific datasets and could capture these other factors, even if only implicitly.

A limitation of the sampling strategy is the PyRosetta mutation scan only repacks mutated residues and nearby side chains, while the backbone and most of the protein structure remain fixed. This limited sampling may miss important structural rearrangements that occur after a mutation, especially in flexible regions of the protein.

\newpage
* Data Processing
#+begin_src R
  library(tidyverse)
  library(grid)
  setwd("/home/alex/Documents/structural_biology/lab7") # Change based off file system
  mc4r <- read_tsv("data/mc4r_dms.tsv")
  mc4r <- mc4r %>%
    mutate(
      compound_dose = factor(
        paste(compound, dose, sep=" "),
        levels=c(
          "aMSH high", "aMSH medium", "aMSH low",
          "THIQ high", "THIQ medium", "THIQ low",
          "None zero"
        )
      )        
    )
  head(mc4r)

  heatmap_plot <- ggplot(mc4r_summary, aes(x = pos, y = aa, fill = statistic)) +
    geom_tile(color = "white") +
    scale_fill_gradient2(low = "blue", mid = "white", high = "red", midpoint = 0) +
    facet_grid(compound_dose ~ pathway) +
    labs(x = "Position", y = "Amino Acid", fill = "Statistic") +
    theme_minimal() +
    theme(
      axis.text.x = element_text(angle = 90, vjust = 0.5),
      panel.spacing = unit(0.5, "lines")
    )
  ggsave("product/mc4r_heatmap.png", plot=heatmap_plot, width=10, height=8, dpi=300)
  ggsave("product/mc4r_heatmap.pdf", plot=heatmap_plot, width=10, height=8, dpi=300)  
#+end_src

#+RESULTS:
: product/mc4r_heatmap.pdf

#+begin_src R :exports code
  mc4r_volcano <- mc4r %>%
  mutate(
    neg_log10_padj = -log10(p.adj)
  ) %>%
  filter(neg_log10_padj < 15)  # remove extreme outliers

  volcano_plot <- ggplot(
    mc4r_volcano,
    aes(x = log2FoldChange, y = neg_log10_padj)
  ) +
    geom_point(alpha = 0.6, size = 1) +
    geom_hline(yintercept = -log10(0.05), linetype = "dashed", color = "red") +
    geom_vline(xintercept = c(-1, 1), linetype = "dashed", color = "blue") +
    facet_grid(compound_dose ~ pathway) +
    labs(
      x = "Effect Size (log2 Fold Change)",
      y = "-log10(adjusted p-value)"
    ) +
    theme_minimal()

  ggsave(
    "product/mc4r_volcano.png",
    plot = volcano_plot,
    width = 10,
    height = 8,
    dpi = 300
  )

  ggsave(
    "product/mc4r_volcano.pdf",
    plot = volcano_plot,
    width = 10,
    height = 8
  )
#+end_src

#+RESULTS:
: product/mc4r_volcano.pdf

#+begin_src R :exports code
  best_scores <- mc4r %>%
  group_by(pos) %>%
  summarize(score = max(statistic, na.rm = TRUE)) %>%
  mutate(chain_id = "A",
         res_id = pos) %>%
  select(chain_id, res_id, score)

  write_tsv(best_scores, "intermediate/mc4r_scores.tsv")
#+end_src

#+RESULTS:
| A |   1 | 1.97522544814857 |
| A |   2 | 3.52683655665843 |
| A |   3 | 3.43224288294632 |
| A |   4 | 3.69218766289249 |
| A |   5 | 2.29390721362723 |
| A |   6 | 4.27274134945557 |
| A |   7 | 3.07603715444079 |
| A |   8 | 2.95656229811906 |
| A |   9 | 3.19645969437747 |
| A |  10 | 3.20235173326354 |
| A |  11 |  3.1512731239824 |
| A |  12 | 4.15472039377703 |
| A |  13 | 2.78782204240235 |
| A |  14 | 8.17825577582573 |
| A |  15 | 8.50931582207345 |
| A |  16 | 3.40354674550889 |
| A |  17 | 8.99156889414457 |
| A |  18 | 2.66625060479941 |
| A |  19 | 10.0607256075923 |
| A |  20 | 6.06804606400586 |
| A |  21 | 5.07097488293933 |
| A |  22 | 2.72343126462001 |
| A |  23 | 3.02071291534277 |
| A |  24 | 3.38026246352459 |
| A |  25 | 2.90047042724651 |
| A |  26 | 4.08924839035212 |
| A |  27 | 3.11332921159417 |
| A |  28 | 2.24114627492019 |
| A |  29 | 3.03855807077827 |
| A |  30 | 2.89917874512046 |
| A |  31 | 4.24429687737857 |
| A |  32 |  3.1964031491023 |
| A |  33 | 2.99270476220395 |
| A |  34 | 2.60762101408695 |
| A |  35 | 2.90335999777089 |
| A |  36 | 2.52253549657942 |
| A |  37 | 2.25575726112428 |
| A |  38 | 2.95047668874321 |
| A |  39 | 4.07180447302175 |
| A |  40 | 2.87197069085547 |
| A |  41 | 3.48421985051261 |
| A |  42 | 2.32788699238949 |
| A |  43 | 2.58214912747669 |
| A |  44 | 2.27043607187643 |
| A |  45 |  1.8371175239297 |
| A |  46 | 2.76207900032916 |
| A |  47 | 4.60632367722713 |
| A |  48 | 2.82111276875356 |
| A |  49 | 5.02130334455482 |
| A |  50 | 2.84721308953487 |
| A |  51 | 5.36840059189716 |
| A |  52 | 3.81444759487091 |
| A |  53 | 3.49960656105868 |
| A |  54 | 2.68087363755756 |
| A |  55 | 3.21882514035365 |
| A |  56 | 3.72776291335367 |
| A |  57 | 2.30156765649635 |
| A |  58 | 4.98685854289807 |
| A |  59 | 3.91682067639893 |
| A |  60 | 3.22359811154095 |
| A |  61 | 2.83732944142875 |
| A |  62 | 2.68966457869452 |
| A |  63 | 3.85907005258016 |
| A |  64 | 2.80023483135719 |
| A |  65 | 1.74534174795718 |
| A |  66 | 2.24163204963532 |
| A |  67 | 1.88054877826077 |
| A |  68 | 2.93849976515462 |
| A |  69 | 3.07086050660536 |
| A |  70 | 2.80539253424455 |
| A |  71 |  3.7221690036391 |
| A |  72 | 2.02573133588289 |
| A |  73 | 2.84739626684897 |
| A |  74 | 5.77188066666359 |
| A |  75 | 2.93293676688439 |
| A |  76 | 4.88862513284362 |
| A |  77 | 7.31646744122329 |
| A |  78 |  2.7192845195894 |
| A |  79 | 14.3034937731177 |
| A |  80 | 3.12965436283404 |
| A |  81 | 4.24345884451349 |
| A |  82 |  3.0628260022162 |
| A |  83 | 5.84950602881082 |
| A |  84 |  3.8857877276941 |
| A |  85 | 5.55885824876233 |
| A |  86 | 2.90514311089979 |
| A |  87 | 2.60387868868979 |
| A |  88 | 2.10112385264352 |
| A |  89 | 2.18071900992476 |
| A |  90 | 2.49889486682859 |
| A |  91 | 3.08867429450076 |
| A |  92 | 3.56062979339884 |
| A |  93 | 5.50100649644869 |
| A |  94 | 5.96948853470154 |
| A |  95 | 1.45042380535826 |
| A |  96 | 2.45572938379867 |
| A |  97 | 9.44976829881309 |
| A |  98 | 5.77125705830432 |
| A |  99 | 5.41517316485599 |
| A | 100 | 4.92890621546567 |
| A | 101 | 6.18610751878039 |
| A | 102 | 2.44278378672385 |
| A | 103 |  2.7433285458274 |
| A | 104 |  5.5910279586338 |
| A | 105 | 4.72076299470507 |
| A | 106 | 2.98393551304853 |
| A | 107 | 3.02017649028993 |
| A | 108 | 3.92419465042071 |
| A | 109 | 2.56757672507704 |
| A | 110 | 2.53896817456667 |
| A | 111 | 3.18465018641519 |
| A | 112 | 3.49889213633673 |
| A | 113 | 3.19615936146318 |
| A | 114 | 2.64432111158504 |
| A | 115 | 4.23380774937338 |
| A | 116 | 2.97150967007394 |
| A | 117 | 2.99172843596881 |
| A | 118 | 5.82239625109985 |
| A | 119 | 9.17406379972862 |
| A | 120 | 6.50053713723097 |
| A | 121 | 4.49703005684985 |
| A | 122 | 8.10903345831425 |
| A | 123 |  2.9280634928146 |
| A | 124 | 2.43143503402705 |
| A | 125 | 2.98907269407507 |
| A | 126 |  3.7698586788773 |
| A | 127 | 3.80932184736035 |
| A | 128 | 2.59060465161324 |
| A | 129 | 4.66536320345011 |
| A | 130 | 3.47000076086132 |
| A | 131 | 5.40042761626016 |
| A | 132 | 1.11015185572481 |
| A | 133 | 6.91450000356578 |
| A | 134 | 2.08448466655481 |
| A | 135 | 2.79308504670529 |
| A | 136 | 2.08244840689067 |
| A | 137 | 8.97839999720743 |
| A | 138 | 3.91773540476094 |
| A | 139 | 2.44360578808259 |
| A | 140 | 10.6666940399431 |
| A | 141 | 6.33648360036486 |
| A | 142 | 4.47921730476925 |
| A | 143 | 3.27939733000291 |
| A | 144 | 2.45843765144092 |
| A | 145 |  2.8268597102271 |
| A | 146 | 9.32089682390424 |
| A | 147 |  2.0548889639459 |
| A | 148 | 3.63104079693683 |
| A | 149 | 4.94453571478227 |
| A | 150 | 6.85815955735913 |
| A | 151 | 6.47757213410907 |
| A | 152 | 11.2825544129535 |
| A | 153 | 3.23680925681932 |
| A | 154 | 4.40658942835262 |
| A | 155 | 2.02134875951535 |
| A | 156 | 2.87894148519453 |
| A | 157 | 2.75398577711142 |
| A | 158 | 8.32593973561876 |
| A | 159 | 4.76939545724611 |
| A | 160 | 3.11989696510664 |
| A | 161 | 1.79208507535612 |
| A | 162 | 2.35565682953917 |
| A | 163 | 3.50440865861947 |
| A | 164 | 3.53535112632061 |
| A | 165 |  2.9067721373593 |
| A | 166 | 7.12436281269442 |
| A | 167 | 3.22815910715029 |
| A | 168 | 2.02410373640855 |
| A | 169 | 2.58452191181165 |
| A | 170 | 2.08896146771504 |
| A | 171 |  3.8208647726866 |
| A | 172 | 2.78271530452332 |
| A | 173 | 4.40597762846702 |
| A | 174 | 2.03074133164769 |
| A | 175 | 3.38041051879596 |
| A | 176 | 3.37254794722757 |
| A | 177 | 3.90743138807568 |
| A | 178 | 3.30897456350371 |
| A | 179 | 1.87232647503101 |
| A | 180 | 2.60316910369567 |
| A | 181 |  1.8696934191816 |
| A | 182 | 1.97141114975523 |
| A | 183 | 2.72357660504908 |
| A | 184 | 5.09293540290295 |
| A | 185 | 2.22242748486588 |
| A | 186 | 3.11923392711479 |
| A | 187 | 2.12880609064025 |
| A | 188 | 3.43602325428177 |
| A | 189 | 2.00082090797091 |
| A | 190 | 2.53463636676403 |
| A | 191 | 3.85532889177704 |
| A | 192 | 3.29056868767657 |
| A | 193 | 2.33453702634321 |
| A | 194 | 3.30126709501522 |
| A | 195 | 2.36690014890585 |
| A | 196 | 4.60740469042799 |
| A | 197 | 5.11051003739657 |
| A | 198 | 3.37173424857415 |
| A | 199 | 3.00485285144165 |
| A | 200 | 7.51881060878525 |
| A | 201 | 4.12218492932476 |
| A | 202 | 2.16081373567318 |
| A | 203 | 4.20647287844841 |
| A | 204 | 7.64401655280819 |
| A | 205 |  7.1926524041399 |
| A | 206 | 2.98767511321156 |
| A | 207 | 4.50149682184899 |
| A | 208 | 2.80357470961738 |
| A | 209 | 4.54607458941062 |
| A | 210 | 4.15646258577407 |
| A | 211 | 3.30677171098195 |
| A | 212 | 1.39709751145207 |
| A | 213 | 3.25797353100038 |
| A | 214 | 6.91366886149412 |
| A | 215 | 1.92078953741781 |
| A | 216 | 4.66163412972612 |
| A | 217 |  3.3481539120422 |
| A | 218 | 5.67677605620179 |
| A | 219 | 1.95601381634043 |
| A | 220 | 2.76427059487474 |
| A | 221 | 4.44426260351697 |
| A | 222 | 3.90776371633792 |
| A | 223 |  14.291342963077 |
| A | 224 | 3.14836333722237 |
| A | 225 | 2.64649775620991 |
| A | 226 | 4.49952592032626 |
| A | 227 |  2.4448930542385 |
| A | 228 | 7.61174522064451 |
| A | 229 | 3.08285441846215 |
| A | 230 | 6.44768317194495 |
| A | 231 | 2.60908944725796 |
| A | 232 | 5.93738351613082 |
| A | 233 | 4.88947216801437 |
| A | 234 | 4.61004638728991 |
| A | 235 | 5.22200140461101 |
| A | 236 | 3.75413241670846 |
| A | 237 | 5.85108773847143 |
| A | 238 | 4.73108810305407 |
| A | 239 | 6.69197573545075 |
| A | 240 | 5.38884101368502 |
| A | 241 | 5.00543490521947 |
| A | 242 | 4.44610802316168 |
| A | 243 | 2.51253080059429 |
| A | 244 |  4.5673161752428 |
| A | 245 | 2.89323900332945 |
| A | 246 | 5.99765223114721 |
| A | 247 | 3.12439218432926 |
| A | 248 | 3.34209268173504 |
| A | 249 |   3.265992428665 |
| A | 250 | 5.28334258353303 |
| A | 251 | 2.34140995756343 |
| A | 252 |   3.477174863375 |
| A | 253 |  9.2799530566392 |
| A | 254 | 15.5304429546214 |
| A | 255 | 3.44962916715078 |
| A | 256 | 2.54966631692519 |
| A | 257 | 3.88680517962283 |
| A | 258 | 7.50558343798924 |
| A | 259 |  4.7926010054027 |
| A | 260 | 2.70407373784201 |
| A | 261 | 2.13942961726568 |
| A | 262 | 2.48255484279679 |
| A | 263 | 2.25711916708507 |
| A | 264 | 2.90471997868923 |
| A | 265 | 2.22110756940135 |
| A | 266 |  3.9298566898163 |
| A | 267 |  2.8955578086185 |
| A | 268 | 3.34598922883421 |
| A | 269 | 2.99948477840911 |
| A | 270 | 2.59912570997263 |
| A | 271 | 2.37296743877377 |
| A | 272 | 2.43601117529981 |
| A | 273 | 3.06971250006765 |
| A | 274 | 2.46374310851516 |
| A | 275 | 2.90014229087849 |
| A | 276 | 2.76154537244316 |
| A | 277 | 3.20167627067369 |
| A | 278 | 2.92976547316788 |
| A | 279 | 3.05759240642184 |
| A | 280 | 3.30010791683593 |
| A | 281 | 2.26380293357392 |
| A | 282 | 4.11045300136576 |
| A | 283 | 3.41406700005987 |
| A | 284 | 2.79666349441315 |
| A | 285 |  3.1333881002535 |
| A | 286 |   2.213600039375 |
| A | 287 |   3.089129852079 |
| A | 288 | 3.97966722402574 |
| A | 289 | 4.70402616487724 |
| A | 290 | 2.20304884051197 |
| A | 291 | 3.86095338932793 |
| A | 292 | 2.46550859138289 |
| A | 293 | 3.54165917977383 |
| A | 294 |  3.1672648427498 |
| A | 295 | 4.90883625284934 |
| A | 296 | 2.87546034825956 |
| A | 297 | 1.96942311850139 |
| A | 298 | 3.10570891602368 |
| A | 299 | 1.65243917849989 |
| A | 300 | 3.46027335383911 |
| A | 301 | 2.64366896353663 |
| A | 302 | 1.80959258018086 |
| A | 303 | 2.29744681990075 |
| A | 304 | 2.22069703275824 |
| A | 305 | 8.65303702551201 |
| A | 306 | 5.90756367714214 |
| A | 307 | 2.48459877863893 |
| A | 308 | 4.15341317727998 |
| A | 309 | 4.07058478510812 |
| A | 310 | 3.15022548275246 |
| A | 311 |  3.0913828402065 |
| A | 312 | 3.70461719691393 |
| A | 313 | 7.60916944840261 |
| A | 314 | 3.65796490497996 |
| A | 315 | 3.00683359184476 |
| A | 316 | 2.88575820716729 |
| A | 317 | 2.94796729119513 |
| A | 318 | 3.94126250836088 |
| A | 319 | 2.70471935541759 |
| A | 320 | 3.75367856460544 |
| A | 321 | 2.51756053479913 |
| A | 322 | 3.34058796527928 |
| A | 323 | 4.23667374010496 |
| A | 324 | 3.34764762249353 |
| A | 325 | 2.83994965284239 |
| A | 326 | 3.17039140433231 |
| A | 327 | 3.86264337296994 |
| A | 328 | 5.09290077640597 |
| A | 329 | 2.77536281797054 |
| A | 330 |   5.290558954131 |
| A | 331 | 3.20110251719705 |
| A | 332 | 3.32139777668981 |
The following plots are listed as ~product/{protein}_bfactors.png~. 
#+begin_src bash :exports none
  python src/set_bfactors.py \
    --input_cif data/8QJ2.cif \
    --scores_tsv intermediate/mc4r_scores.tsv \
    --output_cif intermediate/8QJ2_scored.cif \
    --chain_id_col chain_id \
    --res_id_col res_id \
    --score_col score
  
  python src/set_bfactors.py \
    --input_cif data/7F53.cif \
    --scores_tsv intermediate/mc4r_scores.tsv \
    --output_cif intermediate/7F53_scored.cif \
    --chain_id_col chain_id \
    --res_id_col res_id \
    --score_col score

  python src/set_bfactors.py \
    --input_cif data/7F58.cif \
    --scores_tsv intermediate/mc4r_scores.tsv \
    --output_cif intermediate/7F58_scored.cif \
    --chain_id_col chain_id \
    --res_id_col res_id \
    --score_col score  
#+end_src

#+RESULTS:
| Wrote | modified  | CIF | to    | product/8QJ2_scored.cif |    |                 |                             |                             |
| To    | visualize | in  | pymol | `spectrum               | b, | blue_white_red, | minimum=1.1101518557248142, | maximum=15.530442954621432` |
| Wrote | modified  | CIF | to    | product/7F53_scored.cif |    |                 |                             |                             |
| To    | visualize | in  | pymol | `spectrum               | b, | blue_white_red, | minimum=1.1101518557248142, | maximum=15.530442954621432` |
| Wrote | modified  | CIF | to    | product/7F58_scored.cif |    |                 |                             |                             |
| To    | visualize | in  | pymol | `spectrum               | b, | blue_white_red, | minimum=1.1101518557248142, | maximum=15.530442954621432` |

\newpage
* Pyrosetta Mutations
The last file, 8QJ2 is taking a while.
If it is not in the final submission, something happened that caused it to fail part way through.

The correlations were statistically significant due to the large number of observations, but the effect sizes were small. This suggests Rosetta stability predictions capture some structural effects but do not fully explain functional outcomes measured in the deep mutational scan.
#+begin_src python
  import os
  import pandas as pd
  import pyrosetta

  os.chdir("/home/alex/Documents/structural_biology/lab7")
  pyrosetta.init("-mute all")

  relaxed_pose = pyrosetta.rosetta.core.import_pose.pose_from_file(
      filename="data/relaxed.pdb", # relaxed PDB or the distributed cif file? 
      read_fold_tree=False,
      type=pyrosetta.rosetta.core.import_pose.FileType.PDB_file
  )
  relaxed_pose_backup = relaxed_pose.clone()

  sfxn = pyrosetta.create_score_function(weights_tag="ref2015")
  relax = pyrosetta.rosetta.protocols.relax.FastRelax(
      scorefxn_in=sfxn,
      standard_repeats=1
  )
  print(relax)  
#+end_src

#+RESULTS:
#+begin_example
┌───────────────────────────────────────────────────────────────────────────────┐
│                                  PyRosetta-4                                  │
│               Created in JHU by Sergey Lyskov and PyRosetta Team              │
│               (C) Copyright Rosetta Commons Member Institutions               │
│                                                                               │
│ NOTE: USE OF PyRosetta FOR COMMERCIAL PURPOSES REQUIRES PURCHASE OF A LICENSE │
│          See LICENSE.PyRosetta.md or email license@uw.edu for details         │
└───────────────────────────────────────────────────────────────────────────────┘
PyRosetta-4 2026 [Rosetta PyRosetta4.Release.python312.ubuntu 2026.06+release.e5a76a2dbd7e42e1271d0af460926c86e29e59d1 2026-02-02T18:21:37] retrieved from: http://www.pyrosetta.org
<pyrosetta.rosetta.protocols.relax.FastRelax object at 0x7fdef3188170>
#+end_example

\newpage

#+begin_src python
  def pack(pose, posi, amino, scorefxn):

      # Select Mutate Position
      mut_posi = pyrosetta.rosetta.core.select.residue_selector.ResidueIndexSelector()
      mut_posi.set_index(posi)
      #print(pyrosetta.rosetta.core.select.get_residues_from_subset(mut_posi.apply(pose)))

      # Select Neighbor Position
      nbr_selector = pyrosetta.rosetta.core.select.residue_selector.NeighborhoodResidueSelector()
      nbr_selector.set_focus_selector(mut_posi)
      nbr_selector.set_include_focus_in_subset(True)
      #print(pyrosetta.rosetta.core.select.get_residues_from_subset(nbr_selector.apply(pose)))

      # Select No Design Area
      not_design = pyrosetta.rosetta.core.select.residue_selector.NotResidueSelector(mut_posi)
      #print(pyrosetta.rosetta.core.select.get_residues_from_subset(not_design.apply(pose)))

      # The task factory accepts all the task operations
      tf = pyrosetta.rosetta.core.pack.task.TaskFactory()

      # These are pretty standard
      tf.push_back(pyrosetta.rosetta.core.pack.task.operation.InitializeFromCommandline())
      tf.push_back(pyrosetta.rosetta.core.pack.task.operation.IncludeCurrent())
      tf.push_back(pyrosetta.rosetta.core.pack.task.operation.NoRepackDisulfides())

      # Disable Packing
      prevent_repacking_rlt = pyrosetta.rosetta.core.pack.task.operation.PreventRepackingRLT()
      prevent_subset_repacking = pyrosetta.rosetta.core.pack.task.operation.OperateOnResidueSubset(prevent_repacking_rlt, nbr_selector, True )
      tf.push_back(prevent_subset_repacking)

      # Disable design
      tf.push_back(pyrosetta.rosetta.core.pack.task.operation.OperateOnResidueSubset(
          pyrosetta.rosetta.core.pack.task.operation.RestrictToRepackingRLT(),not_design))

      # Enable design
      aa_to_design = pyrosetta.rosetta.core.pack.task.operation.RestrictAbsentCanonicalAASRLT()
      aa_to_design.aas_to_keep(amino)
      tf.push_back(pyrosetta.rosetta.core.pack.task.operation.OperateOnResidueSubset(aa_to_design, mut_posi))
      
      # Create Packer
      packer = pyrosetta.rosetta.protocols.minimization_packing.PackRotamersMover()
      packer.task_factory(tf)

      #Perform The Move
      if not os.getenv("DEBUG"):
        packer.apply(pose)

  print("Starting relaxes")
  names = ["8QJ2", "7F58", "7F53"]

  #Load the previously-relaxed pose.
  relaxPose = pyrosetta.pose_from_pdb("data/relaxed.pdb") 

  #Clone it
  original = relaxPose.clone()
  scorefxn = pyrosetta.get_score_function()
  print(f"Relaxed Old Energy:", scorefxn(original))
  pack(relaxPose, 130, 'A', scorefxn)
  print(f"Relaxed New Energy:", scorefxn(relaxPose))

  for name in names:
      #Load the previously-relaxed pose.
      relaxPose = pyrosetta.pose_from_file(
          filename=f"data/{name}.cif",
          read_fold_tree=False,
          type=pyrosetta.rosetta.core.import_pose.FileType.CIF_file
      ) # relaxed pdb from lab 6 or distributed cif? 
      
      #Clone it
      original = relaxPose.clone()
      scorefxn = pyrosetta.get_score_function()
      print(f"{name} Old Energy:", scorefxn(original))
      pack(relaxPose, 130, 'A', scorefxn)
      print(f"{name} New Energy:", scorefxn(relaxPose))
#+end_src

#+RESULTS:
: Starting relaxes
: Relaxed Old Energy: -543.706309913086
: Relaxed New Energy: -541.9142449949933
: 8QJ2 Old Energy: 3231.534717521848
: 8QJ2 New Energy: 3182.0993088508826
: 7F58 Old Energy: 330.56569890702826
: 7F58 New Energy: 311.05810655935767
: 7F53 Old Energy: -414.4993230604293
: 7F53 New Energy: -425.269063639838

\newpage
#+begin_src python
  dms = pd.read_csv("data/mc4r_dms.tsv", sep="\t")

  # remove nonsense
  dms = dms[dms["aa"] != "*"]

  # keep only canonical residues
  valid_aas = list("ACDEFGHIKLMNPQRSTVWY")
  dms = dms[dms["aa"].isin(valid_aas)]

  def compute_ddg(pose, pdb_pos, mutant_aa):

    pose_mut = pose.clone()

    pose_index = pose_mut.pdb_info().pdb2pose(chain='A', res=int(pdb_pos))

    if pose_index == 0:
        return None

    wt_score = scorefxn(pose_mut)

    # mutate + repack neighbors
    pack(pose_mut, pose_index, mutant_aa, scorefxn)

    mut_score = scorefxn(pose_mut)

    return mut_score - wt_score  

  for pose_file in ["relaxed.pdb", "7F53.cif", "7F58.cif", "8QJ2.cif"]:
    pose = pyrosetta.pose_from_file(f"data/{pose_file}")
    
    scorefxn = pyrosetta.get_score_function()
    
    results = []

    for _, row in dms.iterrows():

      pos = int(row["pos"])
      aa = row["aa"]

      ddg = compute_ddg(pose, pos, aa)

      if ddg is None:
          continue

      results.append({
          "pos": pos,
          "aa": aa,
          "pred_ddg": ddg
      })
      pass
    results_df = pd.DataFrame(results)

    results_df.to_csv(
      f"intermediate/{pose_file}_rosetta_ddg.tsv",
      sep="\t",
      index=False
    )
    
    print(f"Saved predictions for {pose_file}:", len(results_df))
    pass
#+end_src

#+RESULTS:

\newpage
* Plots
Some of the spearman plots look very flat, but others are grouped into two bubbles.
There is not significant correlation though. 
#+begin_src python :tangle no 
  import pandas as pd
  import numpy as np

  dms = pd.read_csv("data/mc4r_dms.tsv", sep="\t")
  filename = "8QJ2.cif" # "relaxed.pdb" # "7F53.cif" # "7F58.cif"
  rosetta = pd.read_csv(f"intermediate/{filename}_rosetta_ddg.tsv", sep="\t")

  # remove nonsense
  dms = dms[dms["aa"] != "*"]

  # create compound_dose column (for faceting)
  dms["compound_dose"] = dms["compound"] + "_" + dms["dose"]

  # merge predictions with experiment
  merged = dms.merge(
      rosetta,
      on=["pos","aa"],
      how="inner"
  )

  merged["exp_ddg"] = -merged["log2FoldChange"]
  merged["rosetta_trans"] = np.sign(merged["pred_ddg"]) * np.log10(np.abs(merged["pred_ddg"]) + 1)

  merged = merged.replace([np.inf, -np.inf], np.nan).dropna()

  import seaborn as sns
  import matplotlib.pyplot as plt

  g = sns.lmplot(
      data=merged,
      x="rosetta_trans",
      y="exp_ddg",
      col="pathway",
      row="compound_dose",
      scatter_kws={"alpha":0.4, "s":10},
      line_kws={"color":"red"},
      height=3
  )

  g.set_axis_labels(
      "Rosetta predicted ddG (log10 transformed)",
      "-log2FoldChange (experimental)"
  )

  plt.tight_layout()
  plt.savefig(f"product/{filename}_rosetta_vs_experiment.png", dpi=300)
  plt.savefig(f"product/{filename}_rosetta_vs_experiment.pdf")

  from scipy.stats import spearmanr

  corr_results = []

  for (pathway, compound, dose), group in merged.groupby(["pathway","compound","dose"]):

      if len(group) < 5:
          continue

      rho, p = spearmanr(
          group["pred_ddg"],
          group["exp_ddg"]
      )

      corr_results.append({
          "pathway": pathway,
          "compound": compound,
          "dose": dose,
          "spearman_rho": rho,
          "p_value": p,
          "n": len(group)
      })

  corr_df = pd.DataFrame(corr_results)

  corr_df.to_csv(
      f"product/{filename}_spearman_correlations.tsv",
      sep="\t",
      index=False
  )

  print(corr_df)  
#+end_src

#+RESULTS:
#+begin_example
   pathway compound  ...       p_value      n
0       Gq     THIQ  ...  1.980643e-37  65408
1       Gq     THIQ  ...  9.439831e-75  65408
2       Gq     THIQ  ...  4.420232e-53  65408
3       Gq     aMSH  ...  6.187739e-09  65408
4       Gq     aMSH  ...  2.163581e-15  65408
5       Gq     aMSH  ...  1.331479e-12  65408
6       Gs     THIQ  ...  6.914165e-54  65408
7       Gs     THIQ  ...  1.568962e-78  65408
8       Gs     THIQ  ...  1.190724e-74  65408
9       Gs     aMSH  ...  2.327624e-82  65408
10      Gs     aMSH  ...  8.716206e-67  65408
11      Gs     aMSH  ...  6.025364e-69  65408

[12 rows x 6 columns]
#+end_example
